Repository: MikeLvd/quote-manager-system-for-woocommerce
Catalog: languages/quote-manager-system-for-woocommerce-*.po
Languages: el

source: Quote Manager: PDF directory protection has been set up.
el: Διαχειριστής Προσφορών: Η προστασία του καταλόγου PDF έχει ρυθμιστεί.

source: Please enter a value with one monetary decimal point (%s) without thousand separators and currency symbols.
el: Παρακαλώ εισάγετε μια τιμή με ένα δεκαδικό σημείο (%s) χωρίς διαχωριστές χιλιάδων και σύμβολα νομίσματος.

source: Select Image
el: Επιλογή Εικόνας

source: Media Library
el: Βιβλιοθήκη πολυμέσων

source: From URL
el: Από URL

source: Enter Image URL
el: Εισάγετε URL Εικόνας

source: Use this image
el: Χρησιμοποιήστε αυτήν την εικόνα

source: Confirm
el: Επιβεβαίωση

source: Cancel
el: Ακύρωση

source: 📨 Sending in progress...
el: 📨 Αποστολή σε εξέλιξη...

source: ✅ Email sent successfully.
el: ✅ Το email στάλθηκε επιτυχώς.

source: ❌ Error:
el: ❌ Σφάλμα:

source: Failed to send.
el: Αποτυχία αποστολής.

source: ❌ Error while sending email.
el: ❌ Σφάλμα κατά την αποστολή του email.

source: Cost
el: Κόστος

source: Remove
el: Αφαίρεση

source: Totals
el: Σύνολα

source: incl. VAT
el: συμπ. ΦΠΑ

source: Total Net Profit
el: Συνολικό Καθαρό Κέρδος

source: Product search failed:
el: Η αναζήτηση προϊόντος απέτυχε:

source: Uploading file...
el: Μεταφόρτωση αρχείου...

source: File uploaded successfully.
el: Το αρχείο μεταφορτώθηκε με επιτυχία.

source: Error uploading file:
el: Σφάλμα κατά τη μεταφόρτωση αρχείου:

source: Select File
el: Επιλογή Αρχείου

source: Remove Attachment
el: Αφαίρεση Συνημμένου

source: View File
el: Προβολή αρχείου

source: Creating customer...
el: Δημιουργία πελάτη...

source: Customer created successfully.
el: Ο πελάτης δημιουργήθηκε με επιτυχία.

source: View customer
el: Προβολή πελάτη

source: Error creating customer.
el: Σφάλμα κατά τη δημιουργία πελάτη.

source: File size exceeds the 2MB limit.
el: Το μέγεθος του αρχείου υπερβαίνει το όριο των 2MB.

source: Invalid file type. Only JPG, JPEG, PNG and PDF files are allowed.
el: Μη έγκυρος τύπος αρχείου. Επιτρέπονται μόνο αρχεία JPG, JPEG, PNG και PDF.

source: Maximum number of attachments reached (10).
el: Έχει επιτευχθεί ο μέγιστος αριθμός συνημμένων (10).

source: Reset to default terms? This will replace your current text.
el: Επαναφορά στους προεπιλεγμένους όρους; Αυτό θα αντικαταστήσει το τρέχον κείμενό σας.

source: Reset to default email template? This will replace your current template.
el: Επαναφορά στο προεπιλεγμένο πρότυπο email; Αυτό θα αντικαταστήσει το τρέχον πρότυπό σας.

source: Updating status...
el: Ενημέρωση κατάστασης...

source: Error updating status.
el: Σφάλμα κατά την ενημέρωση της κατάστασης.

source: %d quotes have been marked as expired.
el: %d προσφορές έχουν επισημανθεί ως ληγμένες.

source: Access denied
el: Η πρόσβαση απορρίφθηκε

source: Security check failed.
el: Η επαλήθευση ασφαλείας απέτυχε.

source: Country is required
el: Η χώρα είναι υποχρεωτική

source: No states found for this country
el: Δεν βρέθηκαν πολιτείες για αυτή τη χώρα

source: Security check failed
el: Η επαλήθευση ασφαλείας απέτυχε

source: Invalid quote ID
el: Μη έγκυρο αναγνωριστικό προσφοράς

source: Customer email is required
el: Το email του πελάτη είναι υποχρεωτικό

source: A user with this email already exists
el: Ένας χρήστης με αυτό το email υπάρχει ήδη

source: Customer created successfully
el: Ο πελάτης δημιουργήθηκε με επιτυχία

source: No file was uploaded.
el: Δεν ανέβηκε κανένα αρχείο.

source: Invalid quote ID.
el: Μη έγκυρο αναγνωριστικό προσφοράς.

source: Maximum number of attachments (%d) reached.
el: Έχει επιτευχθεί ο μέγιστος αριθμός συνημμένων (%d).

source: Invalid file type detected. Only JPG, JPEG, PNG and PDF files are allowed.
el: Εντοπίστηκε μη έγκυρος τύπος αρχείου. Επιτρέπονται μόνο αρχεία JPG, JPEG, PNG και PDF.

source: Failed to upload file.
el: Αποτυχία μεταφόρτωσης αρχείου.

source: Missing required information.
el: Λείπουν απαιτούμενες πληροφορίες.

source: Attachment removed successfully.
el: Το συνημμένο αφαιρέθηκε με επιτυχία.

source: Attachment deleted successfully.
el: Το συνημμένο διαγράφηκε με επιτυχία.

source: Attachment removed, but file could not be deleted from server.
el: Το συνημμένο αφαιρέθηκε, αλλά το αρχείο δεν μπόρεσε να διαγραφεί από τον διακομιστή.

source: Invalid parameters
el: Μη έγκυρες παράμετροι

source: Quote not found
el: Η προσφορά δεν βρέθηκε

source: Invalid status
el: Μη έγκυρη κατάσταση

source: Status updated successfully
el: Η κατάσταση ενημερώθηκε με επιτυχία

source: Your quote from %s
el: Η προσφορά σας από %s

source: Attachments:
el: Συνημμένα:

source: Quote PDF
el: PDF Προσφοράς

source: 🧾 Customer & Shipping Details
el: 🧾 Στοιχεία Πελάτη & Αποστολής

source: 🛒 Quote Products
el: 🛒 Προϊόντα Προσφοράς

source: 📤 Quote Actions
el: 📤 Ενέργειες Προσφοράς

source: ⚙️ Quote Tools
el: ⚙️ Εργαλεία Προσφοράς

source: 🔐 Internal Quote Information
el: 🔐 Εσωτερικές Πληροφορίες Προσφοράς

source: 📧 Email History
el: 📧 Ιστορικό Email

source: 📝 Terms & Conditions
el: 📝 Όροι & Προϋποθέσεις

source: 📎 Attachments
el: 📎 Συνημμένα

source: Billing
el: Χρέωση

source: Load billing address
el: Φόρτωση διεύθυνσης χρέωσης

source: First name
el: Όνομα

source: Last name
el: Επώνυμο

source: Company
el: Εταιρεία

source: Address
el: Διεύθυνση

source: City
el: Πόλη

source: Postcode
el: Ταχυδρομικός Κώδικας

source: Country
el: Χώρα

source: State
el: Πολιτεία

source: Email address
el: Διεύθυνση Email

source: Phone
el: Τηλέφωνο

source: Shipping
el: Αποστολή

source: Copy billing address
el: Αντιγραφή διεύθυνσης χρέωσης

source: Search customers by name, email or company...
el: Αναζήτηση πελατών με όνομα, email ή εταιρεία...

source: Save as New Customer
el: Αποθήκευση ως Νέος Πελάτης

source: Project Details
el: Λεπτομέρειες Έργου

source: Project Name
el: Όνομα Έργου

source: 🔍 Search products...
el: 🔍 Αναζήτηση προϊόντων...

source: ✚ Add Product
el: ✚ Προσθήκη Προϊόντος

source: Image
el: Εικόνα

source: Title
el: Τίτλος

source: Price
el: Τιμή

source: Discount (%)
el: Έκπ (%)

source: Value
el: Αξία

source: Value (incl. VAT)
el: Αξία (με ΦΠΑ)

source: Quantity
el: Ποσότητα

source: Total (€)
el: Σύνολο (€)

source: Subtotal:
el: Υποσύνολο:

source: VAT:
el: ΦΠΑ:

source: Total:
el: Σύνολο:

source: Product
el: Προϊόν

source: Purchase Price (excl. VAT)
el: Τιμή Αγοράς (χωρίς ΦΠΑ)

source: Total Cost
el: Συνολικό Κόστος

source: Total Price
el: Συνολική Τιμή

source: % Markup
el: % Προσαύξηση

source: % Margin
el: % Περιθώριο

source: Totals:
el: Σύνολα:

source: Total Net Profit:
el: Συνολικό Καθαρό Κέρδος:

source: *The above information is only visible to administrators and is not included in the quote PDF.
el: *Οι παραπάνω πληροφορίες είναι ορατές μόνο στους διαχειριστές και δεν περιλαμβάνονται στο PDF της προσφοράς.

source: Quote Status:
el: Κατάσταση Προσφοράς:

source: Include VAT in quote
el: Συμπερίληψη ΦΠΑ στην προσφορά

source: Quote Validity:
el: Ισχύς Προσφοράς:

source: 5 Days
el: 5 Ημέρες

source: 15 Days
el: 15 Ημέρες

source: 30 Days
el: 30 Ημέρες

source: 45 Days
el: 45 Ημέρες

source: 60 Days
el: 60 Ημέρες

source: Custom Date
el: Προσαρμοσμένη Ημερομηνία

source: dd/mm/yyyy
el: ηη/μμ/εεεε

source: Select specific expiration date
el: Επιλογή συγκεκριμένης ημερομηνίας λήξης

source: Preview PDF
el: Προεπισκόπηση PDF

source: Download PDF
el: Λήψη PDF

source: 📧 Send Quote Email
el: 📧 Αποστολή Email Προσφοράς

source: No email history recorded.
el: Δεν καταγράφηκε ιστορικό email.

source: 📅 Date
el: 📅 Ημερομηνία

source: 📧 Recipient
el: 📧 Παραλήπτης

source: ✉️ Subject
el: ✉️ Θέμα

source: 📨 Message
el: 📨 Μήνυμα

source: ✅ Result
el: ✅ Αποτέλεσμα

source: 👁️ Viewed
el: 👁️ Προβλήθηκε

source: Sent
el: Απεστάλη

source: Failed
el: Απέτυχε

source: Email opened at %s
el: Το email ανοίχτηκε στις %s

source: Not yet opened
el: Δεν έχει ανοιχτεί ακόμα

source: View full message
el: Προβολή πλήρους μηνύματος

source: 📩 Full Message
el: 📩 Ολόκληρο Μήνυμα

source: Reset to Default Terms
el: Επαναφορά στις Προεπιλεγμένες Όρους

source: Available placeholders:
el: Διαθέσιμα placeholders:

source: Tip: Use Shift+Enter for line breaks, Enter for new paragraphs, and the toolbar buttons for formatting.
el: Συμβουλή: Χρησιμοποιήστε Shift+Enter για αλλαγές γραμμής, Enter για νέες παραγράφους και τα κουμπιά της γραμμής εργαλείων για μορφοποίηση.

source: Add technical documents, specifications, or any other files that should be attached to this quote.
el: Προσθέστε τεχνικά έγγραφα, προδιαγραφές ή οποιαδήποτε άλλα αρχεία που πρέπει να επισυναφθούν σε αυτήν την προσφορά.

source: Remove File
el: Αφαίρεση Αρχείου

source: Add Attachment
el: Προσθήκη Συνημμένου

source: PDF Document
el: Έγγραφο PDF

source: Word Document
el: Έγγραφο Word

source: Excel Spreadsheet
el: Υπολογιστικό Φύλλο Excel

source: PowerPoint Presentation
el: Παρουσίαση PowerPoint

source: ZIP Archive
el: Αρχείο ZIP

source: RAR Archive
el: Αρχείο RAR

source: File
el: Αρχείο

source: Attachment
el: Συνημμένο

source: Quote
el: Προσφορά

source: Tel:
el: Τηλ:

source: QUOTE
el: ΠΡΟΣΦΟΡΑ

source: TO
el: ΠΡΟΣ

source: Number:
el: Αριθμός:

source: Date:
el: Ημερομηνία:

source: Valid until:
el: Ισχύει μέχρι:

source: Project:
el: Έργο:

source: Disc(%)
el: Έκπ(%)

source: Qty
el: Ποσότητα

source: Total
el: Σύνολο

source: TOTAL:
el: ΣΥΝΟΛΟ:

source: Customer Signature
el: Υπογραφή Πελάτη

source: Signature
el: Υπογραφή

source: Terms & Conditions
el: Όροι & Προϋποθέσεις

source: Attached Files
el: Συνημμένα Αρχεία

source: This quote has been rejected and is no longer available.
el: Αυτή η προσφορά έχει απορριφθεί και δεν είναι πλέον διαθέσιμη.

source: Customer Quotes
el: Προσφορές Πελατών

source: Customer Quote
el: Προσφορά Πελάτη

source: New Quote
el: Νέα Προσφορά

source: Add New Quote
el: Προσθήκη Νέας Προσφοράς

source: Edit Quote
el: Επεξεργασία Προσφοράς

source: View Quote
el: Προβολή προσφοράς

source: Search Quotes
el: Αναζήτηση Προσφορών

source: No Quotes found
el: Δεν βρέθηκαν Προσφορές

source: No Quotes found in Trash
el: Δεν βρέθηκαν Προσφορές στον Κάδο Ανακύκλωσης

source: Number
el: Αριθμός

source: Quote Name
el: Όνομα Προσφοράς

source: Customer
el: Πελάτης

source: Project
el: Έργο

source: Expiration Date
el: Ημερομηνία Λήξης

source: Email Tracking
el: Παρακολούθηση Email

source: Status
el: Κατάσταση

source: Not sent yet
el: Δεν έχει σταλεί ακόμα

source: Sent %1$d time(s), opened %2$d time(s). Last opened: %3$s at %4$s
el: Απεστάλη %1$d φορά(ες), ανοίχθηκε %2$d φορά(ες). Τελευταία άνοιγμα: %3$s στις %4$s

source: Sent %d time(s) but not yet opened
el: Απεστάλη %d φορά(ες) αλλά δεν έχει ανοίξει ακόμα

source: Quotes
el: Προσφορές

source: Unknown
el: Άγνωστο

source: Draft
el: Πρόχειρο

source: Accepted
el: Αποδεκτό

source: Rejected
el: Απορρίφθηκε

source: Expired
el: Έληξε

source: Missing quote parameters.
el: Λείπουν παράμετροι προσφοράς.

source: Invalid access token. Please check the link provided.
el: Μη έγκυρο διακριτικό πρόσβασης. Ελέγξτε τον παρεχόμενο σύνδεσμο.

source: Quote template not found.
el: Δεν βρέθηκε πρότυπο προσφοράς.

source: Revision for quote #%s
el: Αναθεώρηση για την προσφορά #%s

source: Company Details
el: Στοιχεία Εταιρείας

source: Plugin Settings
el: Ρυθμίσεις Πρόσθετου

source: Company Name
el: Όνομα Εταιρείας

source: City & Postal Code
el: Πόλη & Ταχυδρομικός Κώδικας

source: Logo
el: Λογότυπο

source: Default Terms & Conditions
el: Προεπιλεγμένοι Όροι & Προϋποθέσεις

source: Default Email Template
el: Προεπιλεγμένο Πρότυπο Email

source: Data Cleanup
el: Καθαρισμός Δεδομένων

source: Enter your company details that will appear on the quote PDF.
el: Εισάγετε τα στοιχεία της εταιρείας σας που θα εμφανίζονται στο PDF της προσφοράς.

source: Configure plugin behavior and data management options.
el: Ρυθμίστε τη συμπεριφορά του πρόσθετου και τις επιλογές διαχείρισης δεδομένων.

source: These terms will be used as the default for all quotes. You can customize them per quote.
el: Αυτοί οι όροι θα χρησιμοποιηθούν ως προεπιλογή για όλες τις προσφορές. Μπορείτε να τους προσαρμόσετε ανά προσφορά.

source: This template will be used as the default for all quote emails. You can customize it per email when sending.
el: Αυτό το πρότυπο θα χρησιμοποιηθεί ως το προεπιλεγμένο για όλα τα email προσφορών. Μπορείτε να το προσαρμόσετε ανά email κατά την αποστολή.

source: Reset to Default Email Template
el: Επαναφορά στο Προεπιλεγμένο Πρότυπο Email

source: Company Logo
el: Λογότυπο Εταιρείας

source: Delete all quote files and attachments when plugin is uninstalled
el: Διαγραφή όλων των αρχείων προσφοράς και συνημμένων όταν απεγκαθίσταται το πρόσθετο

source: Warning: If checked, all generated quote PDFs and uploaded attachments will be permanently deleted when the plugin is uninstalled.
el: Προειδοποίηση: Αν επιλεγεί, όλα τα παραγόμενα PDF προσφορών και τα ανεβασμένα συνημμένα θα διαγραφούν μόνιμα όταν απεγκατασταθεί το πρόσθετο.

source: Quote Manager Settings
el: Ρυθμίσεις

source: Settings
el: Ρυθμίσεις

source: Please provide your signature to accept the quote.
el: Παρακαλώ παρέχετε την υπογραφή σας για να αποδεχτείτε την προσφορά.

source: Processing...
el: Επεξεργασία...

source: Submitting your response. Please wait...
el: Πραγματοποιείται υποβολή της απάντησης σας. Παρακαλώ περιμένετε...

source: Quote accepted successfully! Redirecting...
el: Η προσφορά έγινε δεκτή με επιτυχία! Πραγματοποιείται ανακατεύθυνση....

source: Quote declined successfully! Redirecting...
el: Η προσφορά απορρίφθηκε με επιτυχία! Πραγματοποιείται ανακατεύθυνση....

source: An error occurred while submitting your response. Please try again.
el: Παρουσιάστηκε σφάλμα κατά την υποβολή της απάντησής σας. Δοκιμάστε ξανά.

source: A server error occurred. Please try again later.
el: Παρουσιάστηκε σφάλμα διακομιστή. Δοκιμάστε ξανά αργότερα.

source: Quote #%s
el: Προσφορά #%s

source: Accept Quote #%s
el: Αποδοχή Προσφοράς #%s

source: Decline Quote #%s
el: Απόρριψη Προσφοράς #%s

source: Quote Accepted
el: Προσφορά Αποδεκτή

source: Quote Declined
el: Προσφορά Απορρίφθηκε

source: Quote Response
el: Απάντηση Προσφοράς

source: Quote #%s - %s
el: Προσφορά #%s - %s

source: Accept Quote #%s - %s
el: Αποδοχή Προσφοράς #%s - %s

source: Decline Quote #%s - %s
el: Απόρριψη Προσφοράς #%s - %s

source: Quote Accepted -
el: Προσφορά Αποδεκτή -

source: Quote Declined -
el: Προσφορά Απορρίφθηκε -

source: Quote Response -
el: Απάντηση Προσφοράς -

source: Invalid quote access token. Please contact us for assistance.
el: Μη έγκυρο διακριτικό πρόσβασης προσφοράς. Παρακαλώ επικοινωνήστε μαζί μας για βοήθεια.

source: Security check failed. Please refresh the page and try again.
el: Ο έλεγχος ασφαλείας απέτυχε. Ανανεώστε τη σελίδα και δοκιμάστε ξανά.

source: Template file %s not found.
el: Το αρχείο προτύπου %s δεν βρέθηκε.

source: Quote #%s has been accepted
el: Η προσφορά #%s έχει γίνει αποδεκτή

source: Dear %s,<br><br>Thank you for accepting our quote. We have attached a copy of the signed quote for your records.<br><br>We will be in touch shortly to discuss the next steps.<br><br>Best regards,<br>%s
el: Αγαπητέ %s,<br><br>Ευχαριστούμε που αποδεχτήκατε την προσφορά μας. Έχουμε επισυνάψει ένα αντίγραφο της υπογεγραμμένης προσφοράς για τα αρχεία σας.<br><br>Θα επικοινωνήσουμε σύντομα για να συζητήσουμε τα επόμενα βήματα.<br><br>Με εκτίμηση,<br>%s

source: Quote #%s has been accepted by %s.<br><br>A copy of the signed quote is attached. Please follow up with the customer to discuss the next steps.<br><br>View the quote: %s
el: Η προσφορά #%s έχει γίνει αποδεκτή από τον/την %s.<br><br>Ένα αντίγραφο της υπογεγραμμένης προσφοράς επισυνάπτεται. Παρακαλώ επικοινωνήστε με τον πελάτη για να συζητήσετε τα επόμενα βήματα.<br><br>Δείτε την προσφορά: %s

source: ADMIN NOTIFICATION
el: ΕΙΔΟΠΟΙΗΣΗ ΔΙΑΧΕΙΡΙΣΤΗ

source: Quote #%s has been declined
el: Η προσφορά #%s έχει απορριφθεί

source: Dear %s,<br><br>We have received your decision to decline our quote. If you would like to discuss this further or have any questions, please don't hesitate to contact us.<br><br>Best regards,<br>%s
el: Αγαπητέ %s,<br><br>Λάβαμε την απόφασή σας να απορρίψετε την προσφορά μας. Αν θέλετε να συζητήσουμε περαιτέρω ή έχετε οποιεσδήποτε ερωτήσεις, μην διστάσετε να επικοινωνήσετε μαζί μας.<br><br>Με εκτίμηση,<br>%s

source: Quote #%s has been declined by %s.<br><br>Reason given: %s<br><br>View the quote: %s
el: Η προσφορά #%s έχει απορριφθεί από τον/την %s.<br><br>Ο λόγος που δόθηκε: %s<br><br>Δείτε την προσφορά: %s

source: No reason provided
el: Δεν δόθηκε λόγος

source: Quote %s notification
el: Ειδοποίηση Προσφοράς %s

source: Quote has been %s by the customer.
el: Η προσφορά έχει %s από τον πελάτη.

source: Quote not found.
el: Η προσφορά δεν βρέθηκε.

source: Accept Quote %s
el: Αποδοχή Προσφοράς %s

source: Dear %s, you are about to accept quote %s. Please sign below to confirm your acceptance.
el: Αγαπητέ %s, πρόκειται να αποδεχτείτε την προσφορά %s. Παρακαλώ υπογράψτε παρακάτω για να επιβεβαιώσετε την αποδοχή σας.

source: Your Signature:
el: Η Υπογραφή σας:

source: Clear Signature
el: Καθαρισμός Υπογραφής

source: Sign & Accept
el: Υπογραφή & Αποδοχή

source: Thank you, %s! Your acceptance of quote %s has been recorded. We have sent you a confirmation email with the signed quote for your records. We will be in touch shortly to discuss the next steps.
el: Ευχαριστούμε, %s! Η αποδοχή της προσφοράς %s έχει καταγραφεί. Σας έχουμε στείλει ένα email επιβεβαίωσης με την υπογεγραμμένη προσφορά για τα αρχεία σας. Θα επικοινωνήσουμε σύντομα για να συζητήσουμε τα επόμενα βήματα.

source: Thank you, %s. We have recorded your decision to decline quote %s. If you would like to discuss this further or have any questions, please don't hesitate to contact us.
el: Ευχαριστούμε, %s. Έχουμε καταγράψει την απόφασή σας να απορρίψετε την προσφορά %s. Αν θέλετε να το συζητήσετε περαιτέρω ή έχετε οποιεσδήποτε ερωτήσεις, μην διστάσετε να επικοινωνήσετε μαζί μας.

source: Your response has been recorded.
el: Η απάντησή σας έχει καταγραφεί.

source: Return to Homepage
el: Επιστροφή στην Αρχική Σελίδα

source: Decline Quote %s
el: Απόρριψη Προσφοράς %s

source: Dear %s, you are about to decline quote %s. If you wish, you can provide a reason for declining this quote.
el: Αγαπητέ %s, πρόκειται να απορρίψετε την προσφορά %s. Αν επιθυμείτε, μπορείτε να παρέχετε έναν λόγο για την απόρριψη αυτής της προσφοράς.

source: Reason for declining (optional):
el: Λόγος απόρριψης (προαιρετικό):

source: Please let us know why you are declining this quote...
el: Παρακαλώ ενημερώστε μας γιατί απορρίπτετε αυτή την προσφορά...

source: Decline Quote
el: Απόρριψη Προσφοράς

source: Quote %s
el: Προσφορά %s

source: Customer:
el: Πελάτης:

source: Status:
el: Κατάσταση:

source: You can download the quote as a PDF, or respond to it using the buttons below.
el: Μπορείτε να κατεβάσετε την προσφορά ως PDF ή να απαντήσετε χρησιμοποιώντας τα κουμπιά παρακάτω.

source: Accept Quote
el: Αποδοχή Προσφοράς

source: You have accepted this quote.
el: Έχετε αποδεχτεί αυτήν την προσφορά.

source: You have declined this quote.
el: Έχετε απορρίψει αυτήν την προσφορά.

source: This quote has expired.
el: Αυτή η προσφορά έχει λήξει.
